# Задача 2: Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input())

c = n % 10
n = n // 10
b = n % 10
a = n // 10

print(a + b + c)